[
  {
    "title": "1. How are stem cells administered?",
    "question": "Patients usually receive between 3 and 5 applications of Stem Cells during the course of a complete treatment protocol. Intravenous (IV) The safest method of applying Stem Cells throughout the body, no anaesthesia is required. Intravenous application typically takes 20 to 30 minutes. Intramuscular (IM) Stem Cells are injected directly into the muscle. With this intramuscular implantation, no anaesthesia is required, and it is very safe. Intra-articular (IA) Stem Cells are injected directly into the affected joint by a licensed physician. This method is commonly used for arthritis. Intra-articular implantation is quite safe and does not require anaesthesia."
  },
  {
    "title": "2. How do stem cells work?",
    "question": "Essentially, they are progenitor cells that are able to regenerate and differentiate from other specialized cell types. Once injected, stem cells follow the inflammatory signals of damaged tissues and have multiple ways of repairing these damaged areas."
  },
  {
    "title": "3. What types of stem cells are used in therapies?",
    "question": "The cells we use at Eternal Medical Center are Mesenchymal Stem Cells. They are ideal for treating, controlling and reversing chronic, autoimmune, inflammatory and degenerative diseases. They also play an important role in the regeneration of injured tissues. At Eternal, the stem cells we use are multipotent. They transform into different types of cells that can regenerate an organ, but not form it. Before using these Stem Cells, they must pass several safety filters according to the standards of the International Society for Cell Therapy (ISCT). In this way we ensure that our treatments produce the best anti-inflammatory activity, the best immunomodulatory capacity and an excellent regenerative process."
  },
  {
    "title": "4. Are your Stem Cell treatments safe?",
    "question": "Yes, in fact, the immune system accepts stem cells thanks to their degree of histocompatibility. And there are hundreds of successful cases that support this statement."
  },
  {
    "title": "5. How long will it take to see the results?",
    "question": "Each body is unique, so response time may vary. Some patients feel changes during their first application, others see improvement within 3 months. And when the injury is very severe, patients show improvement after up to a year."
  },
  {
    "title": "6. Are there any side effects?",
    "question": "No, in some cases certain patients experience temporary discomfort such as: mild fever, headache, nausea or vomiting.... However, these mild discomforts disappear within 24 to 72 hours. No long-term negative side effects have been reported."
  },
  {
    "title": "7. How much does this treatment cost?",
    "question": "The cost and duration depends on your current state of health, so attending an evaluation is very important. During this evaluation, your clinical case is analysed and a complete diagnosis of your health status is made."
  },
  {
    "title": "8. In which diseases have you seen better results when applying your Stem Cell treatment?",
    "question": "Our treatments at Eternal are well known for their effectiveness in treating, controlling and reversing chronic, autoimmune, inflammatory and degenerative diseases. These treatments are ideal for anyone who wishes to regain their health and improve their quality of life. We are witnesses of so many testimonials with excellent results in different ailments, such as: Diabetes, arthritis, lupus, multiple sclerosis, migraine, facial paralysis... Parkinson, carpal tunnel syndrome, lumbago, chronic fatigue, fibromyalgia, leptospirosis and herniated discs."
  }
]
